{
  "Subnets": {
    "SN50: Synth-Network": {
      "description": "The Synth Subnet leverages Bittensor’s decentralized intelligence network to create the world's most powerful synthetic data for price forecasting. Unlike traditional price prediction systems that focus on single-point forecasts, Synth specializes in capturing the full distribution of possible price movements and their associated probabilities, to build the most accurate synthetic data in the world.\n\nMiners in the network are tasked with generating multiple simulated price paths, which must accurately reflect real-world price dynamics including volatility clustering and fat-tailed distributions. Their predictions are evaluated using the Continuous Ranked Probability Score (CRPS), which measures both the calibration and sharpness of their forecasts against actual price movements.\n\nValidators score miners on short-term and long-term prediction accuracy, with recent performance weighted more heavily through an exponential decay function. Daily emissions are allocated based on miners’ relative performance, creating a competitive environment that rewards consistent accuracy.\n\nThe Synth Subnet aims to become a key source of synthetic price data for AI Agents and the go-to resource for options trading and portfolio management, offering valuable insights into price probability distributions.",
      "tags": ["SN50", "Subnet-50", "Synth-Network", "Subnet 50"],
      "children": {
        "Github": {
          "tags": ["Code", "Repository", "SN50", "Synth-Network", "Subnet 50"],
          "link": "https://github.com/mode-network/synth-subnet"
        },
        "White-paper": {
          "tags": ["Document", "White-paper", "SN50", "Synth-Network", "Subnet 50"],
          "link": "https://mirror.xyz/synthdata.eth/n7l_USbZGYBkPQpiggLoIKZSg-jwJHBrSti9xsUKQTQ"
        },
        "Metagraph": {
          "tags": ["Metagraph", "SN50", "Synth-Network", "Subnet 50"],
          "link": "https://taostats.io/subnets/50/metagraph"
        },
        "Website": {
          "tags": ["Website", "Official", "SN50", "Synth-Network", "Subnet 50"],
          "link": "https://www.synthdata.co/"
        },
        "X-account": {
          "tags": ["Social", "X", "SN50", "Synth-Network", "Subnet 50"],
          "link": "https://x.com/SynthdataCo"
        },
        "Discord-Bittensor-SN50": {
          "tags": ["Community", "Discord", "SN50", "Synth-Network", "Subnet 50"],
          "link": "https://discord.com/channels/799672011265015819/1311109830282313781"
        }
      }
    }
  }
}
